import React from 'react';

const About = (props) => {
  return (
    <div className="d-flex flex-column text-white">
    <div className="border p-4 rounded align-self-center w-75">
    <h1>О компании</h1>
        <p>Засноване в 2018 році, Містечко вже 4 роки полегшує водіям пошук, бронювання та оплату паркування. Сьогодні багато водіїв використовують наш відзначений нагородами додаток, щоб знайти паркування щороку. Ми стали улюбленим додатком для паркування у Краматорську.</p> 
        <hr color="#cb1812" />
        <h2>Істория</h2>
        <p>Містечко існує для того, щоб зробити паркування доступнішим, зручнішим та більш екологічним. Почалося з однієї простої, але блискучої ідеї: зв’язати водіїв з невикористаними під’їздами, гаражами та паркувальними місцями. Запущена в 2006 році, наша відзначена нагородами платформа дозволила власникам автотранспорту максимально эфективно використовувати свій час при пошуку парковки, водночас допомагаючи Краматорську розвивати свою мережу паркування унікальним способом.</p>
        <p>Відтоді ми пройшли довгий шлях. Сьогодні ми маємо процвітаючу спільноту, а також керуємо паркувальними місцями для деяких з компаній, що займаються паркуванням автомобілів. Разом ми забезпечуємо простоту паркування для понад 100 тисяч водіїв щороку. Але в міру зростання наша прихильність до інновацій, стійкості та спільноти залишається. За підтримки нашої спеціалізованої різноманітної мережі ми пропонуємо нові рішення для транспортних потреб Краматорську – від зарядки електромобілів до мобільних платежів. Справді, наша подорож тільки розпочалася.</p>
        <hr color="#cb1812" />
    </div>
    </div>
	)}

export default About;