import React from 'react';
import { Form, Button } from 'react-bootstrap';

const Payment = (props) => {
  return (
    <div className="d-flex flex-column text-white">
		<div className="border p-4 rounded align-self-center w-75">
    <h1>Оплата Местечка</h1>
    <hr color="#cb1812"/>
    <h2>Тарифи та способи оплати за паркування</h2>
    <hr color="#cb1812"/>
<p>Паркування у І-ій зоні паркування: вартість – 20 грн/год.</p>
<p>Паркування у ІІ-ій зоні паркування: вартість – 15 грн/год.</p>
<p>Паркування у ІІІ-ій зоні паркування:  вартість – 10 грн/год.</p>
<p>Сплата вартості послуг з паркування здійснюється усіма можливими способами: готівковим (за допомогою паркувального автомату або терміналу оплати на відкритих майданчиках чи у касирів на виїзді зі закритих зон паркування) та безготівковим (банківською карткою; QR-кодом; послугою «мобільне паркування»: мобільний додаток Privat24 та мобільний додаток “UNIP”).</p>

<p>Уся інформація щодо тарифів, способів оплати та графіку роботи розміщена на кожному паркувальному майданчику (на паркувальних автоматах, в’їзних/виїзних терміналах чи інформаційних табло).</p>

<p>Користувачі  паркувальних майданчиків мають можливість придбати абонентські картки у розрізі зонності та різною тривалістю в операторів паркування:</p>

<p>Оператор паркування ТОВ «Маркетинг і Комунікації» (тел. 096 2008545, 093 9950944, e-mail: parking_lv@ukr.net)</p>
    <hr color="#cb1812"/>
    </div>
    </div>
	)}

export default Payment;