import React from 'react';
import { Form, Button } from 'react-bootstrap';

const TermsOfUse = (props) => {
  return (
    <div className="d-flex flex-column text-white">
		<div className="border p-4 rounded align-self-center w-75">
    <h1>Условия пользования Местечка</h1>
    <p>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ ДЛЯ ВЕБ-САЙТА</p>
<p>1. ОПРЕДЕЛЕНИЕ ПОНЯТИЙ</p>
<p>В тексте настоящего Соглашения нижеизложенным терминам дано следующее значение:</p>
<p>"Сайт" означает следующий сайт: Mistechko, который принадлежит Компании и находится по следующей ссылке: www.mistechko.</p>
<p>"Пользователь", "Вы", "Ваш", "Вас", "Вами" или какие-либо другие схожие производные (в зависимости от контекста) означает лицо, которое (1) пользуется Сайтом и/или получило доступ к его Контенту; и (2) дало свое согласие на соблюдение правил пользования Сайтом, изложенных в тексте данного Соглашения, путем использования данного Сайта.</p>
<p>"Компания", "Мы", "Наш", "Нас", "Нами" или какие-либо другие схожие производные (в зависимости от контекста) означает следующее лицо: ООО "МІСТЕЧКО", адрес местонахождения: Украина, м.Краматорськ., бул. Машинобудівників 13 (включая, его филиалы и представительства как на территории Украины, так и за ее пределами, а также какие-либо другие лица, созданные в результате реорганизации Компании), которое является владельцем Сайта или им управляет.</p>
<p>"Контент сайта" означает все объекты, размещенные Компанией и/или третьими лицами (с разрешения Компании) на Сайте, в том числе элементы дизайна, текст, графические изображения, иллюстрации, видео, программы, музыка, звуки, информация, уведомления и какие-либо другие объекты схожего назначения, их подборки или комбинации.</p>
<p>"ПО сайта" означает программное обеспечение, разработанное Компанией (и/или третьими лицами по поручению Компании) для Сайта, включая, однако не ограничиваясь, весь софт, скрипты, коды (HTML коды), программы и тп.</p>
<p>"Услуги" означает совокупно Контент сайта и ПО сайта.</p>
<p>2. ПРИСОЕДИНЕНИЕ К СОГЛАШЕНИЮ</p>
<p>2.1. Пользователи используют Сайт для следующих целей:</p>
<p>Містечко існує для того, щоб зробити паркування доступнішим, зручнішим та більш екологічним.</p>
<p>2.2. Настоящее Пользовательское соглашение (далее "Соглашение") определяет правила и порядок использования Сайта и Услуг, права и обязанности Пользователей, а также регулирует поведение Пользователей при получении доступа к Сайту и Услугам.</p>
<p>2.3. Пользователь принимает условия данного Соглашения посредством продолжения использования Сайта.</p>
<p>2.4. Данное Соглашение является обязательным для его сторон (т.е. для Компании и Пользователя). Уступка Пользователем своих прав по данному Соглашению возможна только после получения предварительного письменного согласия от Компании.</p>
<p>3. ПОЛЬЗОВАТЕЛИ САЙТА</p>
<p>Общие критерии и возраст</p>
<p>3.1. Для использования Сайта Пользователи должны соответствовать следующим критериям (совокупно):</p>
<p>(1) быть не младше 16-лет; и</p>
<p>(2) не быть ограниченным в праве доступа к Сайту и Услугам на основании решения суда, вступившего в законную силу, или в случаях, предусмотренных действующим законодательством или условиями данного Соглашения.</p>
<p>Регистрация на сайте и создание личного аккаунта</p>
<p>3.2. Использование данного Сайта возможно как Пользователями, которые прошли процедуру бесплатной регистрации и создали свой личный аккаунт (кабинет), так и Пользователями, которые отказались от такой регистрации. Незарегистрированные Пользователи не имеют доступа к следующим Услугам:</p>
<p>3.3. Для снятия указанных ограничений и получения полного доступа Пользователю необходимо пройти регистрацию на Сайте. По результатам завершения регистрации Пользователь получает уникальный логин и пароль.</p>
<p>3.4. Действие данного Соглашения распространяется одинаково в полном объеме (без каких-либо исключений) как на зарегистрированных, так и на незарегистрированных Пользователей.</p>
<p>3.5. Для регистрации Пользователю необходимо предоставить следующею информацию о себе:</p>
<p>ФИО, почта, номер телефона, дата рождения</p>
<p>4. ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ</p>
<p>4.1. Компании принадлежат все без исключения права собственности, включая имущественные права интеллектуальной собственности, на весь Контент сайта, а также ПО сайта. ПО сайта и Контент сайта защищены авторским правом в порядке, предусмотренном действующим гражданским законодательством Украины, а также международными договорами и конвенциями в области защиты объектов интеллектуальной собственности.</p>
<p>4.2. Пользователям запрещено копировать, воспроизводить, модифицировать, компилировать, распространять, отображать в какой-либо форме, публиковать, скачивать, передавать, продавать или иным способом распространять или использовать Контент сайта и ПО сайта, кроме случаев, когда такие действия ПРЯМО разрешены условиями данного Соглашения или действующим законодательством Украины.</p>
<p>4.3. Ничто в тексте данного Соглашения не может быть истолковано как передача Пользователю каких-либо исключительных прав на Контент сайта (полностью или в отдельной части) и/или ПО сайта.</p>
<p>4.4. Компания владеет всеми правами в отношении торговых марок, коммерческих (бизнес) наименований, брендов, логотипов, зарегистрированных на ее имя (далее "Торговые марки"). Такие Торговые марки защищаются действующим законодательством и НИЧТО в тексте данного Соглашения не может быть истолковано как передача какой-либо лицензии Пользователю на использование таких Торговых марок.</p>
<p>5. ПОРЯДОК РАБОТЫ С САЙТОМ</p>
<p>Правила поведения на сайте</p>
<p>5.1. Во время использования Сайта Пользователь обязуется придерживаться следующих правил:</p>
<p>(1) соблюдать все обязательства, взятые на себя Пользователем в связи с присоединением к данному Соглашению; и</p>
<p>(2) предоставлять достоверные о себе данные во время регистрации на Сайте и для создания личного аккаунта (кабинета); и</p>
<p>(3) не выдавать себя за какое-либо другое лицо, включая, однако не ограничиваясь, не предоставлять какие-либо данные третьих лиц (без получения от них прямого, предварительного и осознанного согласия) для регистрации на Сайте и/или для создания личного аккаунта (кабинета); и</p>
<p>(4) информировать Компанию о хищении логинов, паролей или каких-либо других ключей доступа Пользователя к личному аккаунту (кабинету); и</p>
<p>(5) не предоставлять третьим лицам доступ к своему аккаунту (кабинету) и/или логины, пароли или другие ключи доступа; и</p>
<p>(6) не совершать какие-либо действия (с использованием средств автоматизации или без таких средств), направленные на сбор каких-либо персональных данных других Пользователей; и</p>
<p>(7) не предпринимать какие-либо действия и не помогать третьим лицам в совершении действий, направленных на подрыв работы Сайта, включая, однако не ограничиваясь, (а) загружать вирусы или вредоносный код; (б) совершать действия, которые могут привести к отключению Сайта, к нарушению нормальной работы Сайта или ПО сайта, или к ухудшению внешнего вида Сайта и/или Контента Сайта.</p>
<p>(8) не предпринимать какие-либо иные действия, которые являются незаконными, мошенническими, дискриминационными или вводящими в заблуждение.</p>
<p>Отзывы о работе сайта</p>
<p>5.2. Каждый Пользователь время от времени имеет право (но не обязанность) оставлять или направлять свои идеи, отзывы, предложения или проекты, направленные на улучшение работы Сайта или качества предоставляемых Услуг. Такие отзывы могут быть направлены Пользователем следующим способом:</p>
<p>Отправить письмо на адрес contact.mictechko@gmail.com</p>
<p>5.3. В случае направления такой идеи, отзыва, предложения или проекта Пользователь автоматически предоставляет нам неисключительную, не требующую лицензионных отчислений, действующую по всему миру лицензию с правом передачи и выдачи сублицензий на хранение, использование, распространение, изменение, запуск, копирование, публичное исполнение или показ, перевод Ваших идей, отзывов, предложений или проектов, а также создание производных работ на их основе.</p>
<p>6. РАЗМЕЩЕНИЕ РЕКЛАМЫ НА САЙТЕ</p>
<p>Размещение рекламы компанией</p>
<p>6.1. Компания имеет право время от времени размещать на Сайте какие-либо рекламные или маркетинговые материалы.</p>
<p>Размещение рекламы третьими лицами</p>
<p>6.2. Контент сайта может содержать ссылки на веб-сайты третьих лиц и/или рекламные или маркетинговые материалы о товарах/услугах, предоставленные такими третьими лицами (далее "Реклама третьих лиц"). КОМПАНИЯ НЕ БЕРЕТ НА СЕБЯ КАКУЮ-ЛИБО ОТВЕТСТВЕННОСТЬ (1) ЗА СОДЕРЖАНИЕ РЕКЛАМЫ ТРЕТЬИХ ЛИЦ, А ТАКЖЕ ЗА НАЛИЧИЕ, КАЧЕСТВО И БЕЗОПАСНОСТЬ ПРОДВИГАЕМЫХ ТОВАРОВ/УСЛУГ В ТАКОЙ РЕКЛАМЕ; и (2) ЗА КАКИЕ-ЛИБО УБЫТКИ, ПОТЕРИ ИЛИ УЩЕРБ, ПОНЕСЕННЫЕ ИЛИ ПРИЧИНЕННЫЕ ПОЛЬЗОВАТЕЛЮ В РЕЗУЛЬТАТЕ ПРОЧТЕНИЯ ИМ ТАКОЙ РЕКЛАМЫ, ИСПОЛЬЗОВАНИЯ ИМ ПРОДВИГАЕМЫХ В РЕКЛАМЕ ТРЕТЬИХ ЛИЦ ТОВАРОВ/УСЛУГ.</p>
<p>6.3. В случае перехода на другой сайт через размещенную на Сайте Рекламу третьих лиц, Компания не может гарантировать, что такой веб-сайт является безопасным для Пользователя и/или его компьютера. Ни что в тексте данного Соглашения не должно быть истолковано как заверение, поощрение, рекомендация или побуждение Пользователя воспользоваться Рекламой третьих лиц, посетить какие-либо сайты третьих лиц, а также попробовать, приобрести, воспользоваться какими-либо товарами/услугами третьих лиц.</p>
<p>6.4. Вопросы, связанные с защитой персональных данных Пользователей при использовании ими Рекламы третьих лиц, регулируются Политикой конфиденциальности для сайта.</p>
<p>7. СОВЕРШЕНИЕ ПОКУПОК ЧЕРЕЗ САЙТ</p>
<p>7.1. Сайт не предоставляет возможность покупки каких-либо товаров/услуг через него.</p>
<p>8. ОФОРМЛЕНИЕ ПОДПИСКИ НА САЙТЕ</p>
<p>8.1. Доступ к Сайту и к его Услугам не предполагает от Пользователей оформления какой-либо подписки.</p>
<p>9. ПРЕКРАЩЕНИЕ ДОСТУПА К САЙТУ</p>
<p>9.1. Пользователь имеет право в любой момент прекратить использование Сайта посредством удаления своего аккаунта:</p>
<p>Удалить аккаунт в личном кабинете</p>
<p>9.2. В случае (1) нарушения Пользователем условий настоящего Соглашения; и/или (2) нарушения прав интеллектуальной собственности Компании, других Пользователей или третьих лиц; и/или (3) совершения действий, которые являются противозаконными, нарушают права и интересы Компании, других Пользователей или третьих лиц или подрывают работу Сайта или возможность использования Сайта другими Пользователями; и/или (4) Услуги или Сайт используется Пользователем таким образом, что это может повлечь юридическую ответственность Компании в будущем; и/или (5) если этого требует действующее законодательство или компетентный государственный орган, Компания имеет право без предварительного уведомления в любой момент прекратить (остановить) доступ Пользователя к Сайту и его Услугам.</p>
<p>9.3. Такое прекращение доступа кроме прочего также подразумевает удаление личного аккаунта Пользователя.</p>
<p>9.4. Пользователь должным образом осведомлен, что Компания не берет на себя ответственность за какой-либо ущерб, убытки, упущенную выгоду, потерю деловой или личной репутации, причиненные Пользователю удалением или блокировкой аккаунта и/или невозможностью доступа к Сайту и его Услугам.</p>
<p>10. ЗАДАТЬ ВОПРОС</p>
<p>10.1. Если у Вас есть вопросы касательно условий настоящего Соглашения или порядка/способа их исполнения, Вы можете адресовать нам свой вопрос следующим способом:</p>
<p>Отправить письмо на contact.mictechko@gmail.com</p>
<p>10.2. Сотрудники и представители Компании обязуются предпринять все возможные усилия для дачи ответа на Ваш запрос в течение разумного периода времени.</p>
<p>11. ОТВЕТСТВЕННОСТЬ</p>
<p>11.1. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ КОМПАНИЯ ИЛИ ЕЕ ПРЕДСТАВИТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ ПЕРЕД ПОЛЬЗОВАТЕЛЕМ ИЛИ ПЕРЕД ЛЮБЫМИ ТРЕТЬИМИ ЛИЦАМИ:</p>
<p>(1) ЗА ЛЮБОЙ КОСВЕННЫЙ, СЛУЧАЙНЫЙ, НЕУМЫШЛЕННЫЙ УЩЕРБ, ВКЛЮЧАЯ УПУЩЕННУЮ ВЫГОДУ ИЛИ ПОТЕРЯННЫЕ ДАННЫЕ, ВРЕД ЧЕСТИ, ДОСТОИНСТВУ ИЛИ ДЕЛОВОЙ РЕПУТАЦИИ, ВЫЗВАННЫЙ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ САЙТА, УСЛУГ ИЛИ ИНЫХ МАТЕРИАЛОВ, К КОТОРЫМ ПОЛЬЗОВАТЕЛЬ ИЛИ ИНЫЕ ЛИЦА ПОЛУЧИЛИ ДОСТУП С ПОМОЩЬЮ САЙТА, ДАЖЕ ЕСЛИ КОМПАНИЯ ПРЕДУПРЕЖДАЛА ИЛИ УКАЗЫВАЛА НА ВОЗМОЖНОСТЬ ТАКОГО ВРЕДА; и</p>
<p>(2) ЗА ДЕЙСТВИЯ ДРУГИХ ПОЛЬЗОВАТЕЛЕЙ, ЗА РАЗМЕЩАЕМЫЙ ПОЛЬЗОВАТЕЛЯМИ ПОЛЬЗОВАТЕЛЬСКИЙ КОНТЕНТ, ЗА ТОВАРЫ/УСЛУГИ, ПРЕДОСТАВЛЯЕМЫЕ ТРЕТЬИМИ ЛИЦАМИ ИЛИ ДРУГИМИ ПОЛЬЗОВАТЕЛЯМИ (ДАЖЕ ЕСЛИ ДОСТУП К НИМ БЫЛ ПРЕДОСТАВЛЕН ЧЕРЕЗ НАШ САЙТ), К КОТОРЫМ ПОЛЬЗОВАТЕЛЬ ПОЛУЧИЛ ДОСТУП; и</p>
<p>(3) в случаях прямо предусмотренных условиями настоящего Соглашения или нормой действующего законодательства.</p>
<p>11.2. Наша ответственность за все что угодно, связанное с использованием Сайта и/или Услуг, ограничивается настолько сильно, насколько это допускается действующим законодательством.</p>
<p>12. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</p>
<p>12.1. В случае возникновения любых споров или разногласий, связанных с исполнением настоящего Соглашения, Пользователь и Компания приложат все усилия для их разрешения путем проведения переговоров между ними. В случае, если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном действующим законодательством Украины.</p>
<p>13. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</p>
<p>13.1. Настоящее Соглашение вступает в силу с момента его опубликования на Сайте (по следующей ссылке: mistechko.com/privacy) и действуют в течение неопределенного периода времени.
<p>13.2. Мы можем время от времени пересматривать, дополнять или изменять условия данного Соглашения. Такие изменения, как правило, не являются ретроспективными. КОМПАНИЯ НЕ БЕРЕТ НА СЕБЯ КАКУЮ-ЛИБО ОБЯЗАННОСТЬ ПО УВЕДОМЛЕНИЮ ПОЛЬЗОВАТЕЛЕЙ О ПРЕДСТОЯЩИХ ИЛИ СОСТОЯВШИХСЯ ИЗМЕНЕНИЯХ ТЕКСТА СОГЛАШЕНИЯ. Посредством присоединения к условиям данного Соглашения Пользователь также берет на себя обязательство периодически просматривать условия данного Соглашения на предмет их изменения или дополнения.</p>
<p>Если после проведенных изменений или дополнений в тексте Соглашения Пользователь продолжает пользоваться Сайтом, это значит, что он ознакомлен с изменениями или дополнениями и их принял в полном объеме без каких-либо возражений.</p>
<p>13.3. Если иное прямо не указано в положениях настоящего Соглашения или прямо не вытекает из норм действующего законодательства, к условиям настоящего Договора применяется материальное право Украины.</p>
<p>13.4. Неотъемлемой частью настоящего Соглашение является Политика конфиденциальности для сайта.</p>
<p>13.5. Если одно или несколько условий данного Соглашения утратило свою юридическую силу или признано недействительным согласно действующему законодательству, остальные условия Соглашения не теряют своей силы и продолжают действовать так, словно признанного недействительным или утратившим юридическую силу условия не существовало вовсе.</p>
<p>13.6. Доступ к Сайту и его Услугам предоставляется Пользователю "как есть", Мы не обещаем, не гарантируем, не подразумеваем, что Услуги и Сайт могут подходить или не подходить Вашим потребностям, целям, ожиданиям, и в связи с чем не гарантируем какого-либо специфического результата или последствия в результате использования Вами Сайта и его Услуг.</p>
  </p>  <hr color="#cb1812"/>
    </div>
    </div>
	)}

export default TermsOfUse;